### Format, Init and Plan Results for *CARING-DEV*
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
aws_s3_bucket.tcloud_bucket_test: Refreshing state... [id=caring-dev-test]
aws_s3_bucket_policy.canario-bucket-policy: Refreshing state... [id=caring-dev-test]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_s3_bucket_policy.canario-bucket-policy has been changed
  ~ resource "aws_s3_bucket_policy" "canario-bucket-policy" {
        id     = "caring-dev-test"
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                        ]
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::caring-dev-test/*",
                          - "arn:aws:s3:::caring-dev-test",
                        ]
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
        # (1 unchanged attribute hidden)
    }
  # aws_s3_bucket.tcloud_bucket_test has been deleted
  - resource "aws_s3_bucket" "tcloud_bucket_test" {
      - acl                         = "public-read" -> null
      - arn                         = "arn:aws:s3:::caring-dev-test" -> null
      - bucket                      = "caring-dev-test" -> null
      - bucket_domain_name          = "caring-dev-test.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "caring-dev-test.s3.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "caring-dev-test" -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "env"          = "caring-dev"
          - "repo_name"    = "tcloud_test"
          - "service_name" = "tcloud_test"
          - "terraform"    = "true"
        } -> null
      - tags_all                    = {
          - "env"          = "caring-dev"
          - "repo_name"    = "tcloud_test"
          - "service_name" = "tcloud_test"
          - "terraform"    = "true"
        } -> null

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.tcloud-test-bucket-policy-document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "tcloud-test-bucket-policy-document"  {
      ~ id      = "857578743" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                        ]
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::caring-dev-test/*",
                          - "arn:aws:s3:::caring-dev-test",
                        ]
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:s3:::caring-dev-test",
              - "arn:aws:s3:::caring-dev-test/*",
              ~ (known after apply),
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # aws_s3_bucket.tcloud_bucket_test will be created
  + resource "aws_s3_bucket" "tcloud_bucket_test" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "caring-dev-tcloud"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "env"          = "caring-dev"
          + "repo_name"    = "tcloud_test"
          + "service_name" = "tcloud_test"
          + "terraform"    = "true"
        }
      + tags_all                    = {
          + "env"          = "caring-dev"
          + "repo_name"    = "tcloud_test"
          + "service_name" = "tcloud_test"
          + "terraform"    = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket_policy.canario-bucket-policy must be replaced
-/+ resource "aws_s3_bucket_policy" "canario-bucket-policy" {
      ~ bucket = "caring-dev-test" -> (known after apply) # forces replacement
      ~ id     = "caring-dev-test" -> (known after apply)
      + policy = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```

</details>`